{
    "1": [
        {
            "team": "Generation M",
            "info": "Generation of Miracles kicked the season off with a pair of dominating wins vs White Walkers and Sheep Dogs. In team stats, they lead the league in points per game (85), assists (26), and rebound (29). And defensively, it was more domination as they held their opponents to an average of 47 ppg (1st in league).  TTM Dondada holds 2 league records at the moment, averaging a league high 32 points per game and 6 steals per game…A true 2 way threat! Point guard, TTM Trixz averages a league high 14.5 assists per game.",
            "last": 0
        },
        {
            "team": "Purple Haze",
            "info": "Purple Haze holds a 2-0 record in tight battles versus Seattle Buckets and Snack Time. They’re 2nd in both offensive and defensive rankings. They’ve been making it rain from downtown, shooting a league high 60% from three point range on 22 attempts per game! Splash Brothers 2.0, Phat Chub and PurpNowitzki are shooting 90% and 89% respectively from downtown on over 9 attempts per game each. Opponents may want to bring out their rain coats with those numbers.",
            "last": 0
        },
        {
            "team": "Snack Time",
            "info": "After week 1, Snack Time sits at 1-1 and finds themselves 3rd in the power rankings. Game 1 versus Purple Haze was tighter than it looks on the scoreboard, but a shaky 2nd and 4th quarter led to their 68-52 loss. They bounced back versus the Sheep Dogs in a dominating 86-43 victory. Some may say they were out for blood (I wouldn’t, but some might.) PG, Sergio Dipp has been dishing out dimes, averaging 12 a game and now holds a league record high 17 assists vs Sheep Dogs.",
            "last": 0
        },
        {
            "team": "Seattle Buckets",
            "info": "The Buckets start the season off with a 1-1 record. In their first game vs 2nd ranked Purple haze, they led 26-18 in the 1st half. But, they lost their mojo in the 2nd half and ultimately lost the game, 56-47.  They had a nice 56-50 victory in their 2nd game versus the Powered Gaming Dragon however, with ACTBADJR posting 24 points and a 18-18 double-double from center Raider768083. Raider currently leads the league in rebounds with an impressive 19.5 rpg average.",
            "last": 0
        },
        {
            "team": "White Walkers",
            "info": "White Walkers started their season off with an ugly 76-51 loss vs Generation of Miracles.  They were down just 9 points in the 3rd quarter, but once center Memphis Isle lagged out of the game, they fell apart.  They bounced back versus Gaming Dragons with a solid 54-42 victory. PG, TicTacTy3204 had a solid season start averaging 16.5 points, 7.5 assists, and 2.5 steals per game.",
            "last": 0
        },
        {
            "team": "Powered Gaming Dragons",
            "info": "The Dragons didn’t have the start they wanted, going 0-2. But, both games they lost were pretty tight. In fact, in their loss against the Seattle Buckets, they actually won 3/4 quarters. The 2nd quarter was killer as the Buckets out scored them 20-4. Mackie Queso starts the season off strong posting 16.5 ppg, 7 rpg, and shooting 71% from downtown!",
            "last": 0
        },
        {
            "team": "Sheep Dogs",
            "info": "Sheep Dogs begin the season with an 0-2 record. And let’s face it, neither game was pretty. However, they faced 2 very tough opponents in Generation of Miracles and Snack Time. This young team has new faces on it and are figuring out their game, so don’t count them out! They recently signed PG, SnoopDeeDoo who hopes to help bring this organization to the next level. ASaintsChaos posted an impressive 22 points and went 6/10 on 3 point attempts in the 1 game he played.",
            "last": 0
        }
    ],
    "2": [
        {
            "team": "Generation M",
            "info": "Generation M holds the #1 spot in the power rankings and stay undefeated. They only played 1 game this past week as they won via forfeit in their 2nd game versus Purple Haze. Although undefeated, they came back down to earth in week 2 in a very wire to wire matchup versus Snack time where they won 59-56 in the final seconds. They still hold the #1 spot in offensive rankings with an average of 76 PPG. The dynamic scoring duo of slasher Aromaticcomet (23 points, 6 assists) and 3 point threat TTM DONDADA (17 points, 5/5 from 3) lead the way for Generation M in this week’s victory.",
            "last": 1
        },
        {
            "team": "Seattle Buckets",
            "info": "The Buckets move from #4 to #2 in this week’s power rankings as their record moves to 3-1.  They had a dominating win vs Fiji Kings (82-34) and another solid win vs White Walkers (62-44), holding their opponents to an average of 39 points this week as they slide into the #1 spot in defensive rankings.  Center, Raider768083 leads the league in rebounds per game with an insane 21.75 rpg average. He’s the clear favorite for the Board Man award early on. He’s also 2nd in blocks per game averaging 2 bpg and 5th in points with 17.50 ppg.",
            "last": 4
        },
        {
            "team": "Snack Time",
            "info": "Snack time goes 1-1 again this week with a forced win vs Gaming Dragons (RIP ) and a 59-56 loss to Generation M. PG, Sergio Dipp is now tied in 1st for assists per game (along with TTM Trixz) with 11 assists per game. PF D4NGERPOWER5 now holds the record for steals per game with 7 steals against Generation M and is tied for 2nd place in steals per game, averaging 3.33 per contest.",
            "last": 3
        },
        {
            "team": "White Walkers",
            "info": " White Walkers jump up a spot in power rankings with a dominant 58-37 win vs Purple Haze. They lost 62-44 vs Seattle Buckets in their 2nd game. SF, The57thPick has been shooting lights out from downtown, averaging 67% from 3. PG, TicTacTy3204 is averaging 16 PPG & 7.75 APG.",
            "last": 5
        },
        {
            "team": "Purple Haze",
            "info": "It was a tough week for Purple Haze, going 0-2 in a 58-37 loss to White Walkers & a forced loss to Generation M. They look to bounce back next week. SG, Phat Chub is 2nd in 3P% averaging 83% from downtown! Center, Ruth x VG is #1 in blocks per game averaging 2.67 per contest.",
            "last": 2
        },
        {
            "team": "Sheep Dogs",
            "info": "Sheep Dogs: Sheep Dogs didn’t play either game this week, forfeiting to FIJI Kings & getting a forced win versus the pathetic mess of an organization, Powered Gaming Dragons.",
            "last": 7
        },
        {
            "team": "Fiji Kings",
            "info": "FIJI Kings start 1-1 with a forced win vs Sheep Dogs & a tough 82-34 loss vs Seattle Buckets.",
            "last": 0
        }
    ],
    "3": [
        {
            "team": "Generation M",
            "info": "Generation stays atop the power rankings with a 6-0 record. They dominated the Fiji kings and had a tight battle with Seattle Buckets. A 29-8 2nd quarter vs Buckets ultimately got them the 74-64 win. So far through this season, TTM Dondada & AromaticComet are looking like the best duo in the league as they are 1st & 2nd in PPG averaging 25.2 and 23 points respectively. TTM Dondada also leads the league in steals & 3P%, averaging 4.2 steals and shooting an insane 86% from the three point territory. TTMTrix is 2nd in assists averaging 11.4 per game.",
            "last": 1
        },
        {
            "team": "Snack Time",
            "info": "Snack time goes 1-1 this week with a win versus White Walkers and a forfeited loss to the Buckets. SergioDipp7124 leads the league in assists, averaging 12 per game. MMH Loaded is having himself a nice season as well averaging 21 points and 8 rebounds per game. Heisenberg24597 is averaging 18.5 points and 3.5 steals (2nd overall) per game.",
            "last": 3
        },
        {
            "team": "Purple Haze",
            "info": "Purple haze had a nice 2-0 record in week 3 versus the winless Sheep Dogs & Fiji Kings, to bring their overall record to 4-2. Phat Chub is 2nd in 3P%, shooting 83% from downtown. As a team, they are 1st in points allowed per game, opponents averaging 50 points against them. And 3rd in points per game offensively, averaging 63.",
            "last": 5
        },
        {
            "team": "Seattle Buckets",
            "info": "Seattle Buckets: Seattle Buckets go 1-1 this week with a forced win versus Snack Time & a tight loss versus Generation M. Raider768083 still leads the league in rebounds, averaging 20 per game.  They are 2nd in defensive rankings per game with teams averaging 51 ppg against them.",
            "last": 2
        },
        {
            "team": "White Walkers",
            "info": "White Walkers remain at .500 with a win versus Sheep Dogs and a loss to Snack Time. PG, TicTacTy3204 is averaging 18 points & 8.7 assists per game. And PF, The57thPick is averaging 17 points & 7 rebounds per game, while shooting 67% from downtown.",
            "last": 4
        },
        {
            "team": "Sheep Dogs",
            "info": "Sheep Dogs go 0-2 this week in tough losses versus White Walkers and Purple Haze.",
            "last": 6
        },
        {
            "team": "Fiji Kings",
            "info": "Fiji Kings go 0-2 this week in tough losses to Generation M & Purple Haze. There’s a long way to go in this season for the bottom 2 teams to turn things around.",
            "last": 7
        }
    ],
    "4": [
        {
            "team": "Generation M",
            "info": "No surprise here. Generation M is now 8-0. They dominated Sheep Dogs this week in a 100-51 victory. They nearly lost to White Walkers this past week. They were down as much as 10 points in the 3rd quarter, but aromaticcomet76 caught fire in the 4th, and they ended up pulling out the 66-63 victory to remain undefeated.",
            "last": 1
        },
        {
            "team": "Snack Time",
            "info": "Snack Time went 2-0 this past week, beating both Purple Haze and Fiji Kings, and are now 5-3 on the season. Rookie point guard, ITryHardQI, has a great start to his blossoming career, averaging 21.5 points & 11 assists in his first 2 starts in red and white.",
            "last": 2
        },
        {
            "team": "Purple Haze",
            "info": "Purple Haze lost 75-72 to Snack Time in their first game this past week. But, bounced back versus Seattle Buckets in a dominating 85-44 victory. PurpNowitzki set a new scoring record in that game with 42 points. Dcouch10 also set a new steal record as well, snagging 9 steals in the blowout.",
            "last": 3
        },
        {
            "team": "White Walkers",
            "info": "White Walkers lost in a tight 66-63 game vs #1 ranked, Generation of Miracles, showing they can compete with the best. They smoked Fiji Kings, 88-52 in their 2nd game.  PG, TicTacTy3204 is averaging 21 points & 9.6 assists per game.",
            "last": 5
        },
        {
            "team": "Seattle Buckets",
            "info": "The Buckets took care of business in their 1st game vs Sheep Dogs, winning 71-55, but had a tough 85-44 to Purple Haze. Center, Raider(insert many digits) is averaging an impressive 17 points & 16.9 rebounds per game.",
            "last": 4
        },
        {
            "team": "Sheep Dogs",
            "info": "Sheep Dogs go 0-2 this past week.",
            "last": 6
        },
        {
            "team": "Fiji Kings",
            "info": "Fiji Kings go 0-2 this past week.",
            "last": 7
        }
    ],
    "5": [
        {
            "team": "Generation M",
            "info": "Generation of Miracles is now 10-0!  They beat Purple Haze in a tight 69-58 battle.  They held PurpNowitzki, who holds the league scoring record at 42, to only 10 points on 3/13 shooting in this win, proving once again their defense is no joke.  They average a league team high of 79 points per game, and also hold opposing offenses to a league low 54 points, making them the number 1 ranked offense and defense. They got a forced win against #2 ranked Snack Time, who they beat in the final seconds last time they played each other. The dynamic duo of AromaticComet and TTM Dondada continue to dominate on both ends of the court. These guys are TOUGH!",
            "last": 1
        },
        {
            "team": "Snack Time",
            "info": "Snack Time received a forced loss this week to Generation and got a 66-48 win versus Fiji Kings. They now sit at 6-4 on the season. New PG, ITryHardQI, has proven to be a nice pickup in his first 3 games, averaging 20 points and 10 assists so far.  New pickup, Verde2x had a nice debut with a 23 point and 4 steals game.",
            "last": 2
        },
        {
            "team": "White Walkers",
            "info": "White Walkers go 2-0 this week with wins against Purple Haze and Seattle Buckets.  Recent pickup Center, I Riot Inc I, has been shooting lights out and now is in 2nd in 3 point percentage, hitting 64% of his shots from downtown. He posted an impressive 16-11-8-3 statline in his game versus Purple Haze.  PG, TicTacTy3204 now leads the league in assists, averaging 9.3 dimes per game.",
            "last": 4
        },
        {
            "team": "Purple Haze",
            "info": "Purple Haze would like to forget this past week as they go winless against 2 tough matchups in Generation M and White Walkers.  It wasn’t all negatives this week for PH, as SG, Wild N Out and PF, ExitbigHen were making it rain from downtown, shooting 8/14 and 8/10 respectively from 3 point territory.",
            "last": 3
        },
        {
            "team": "Seattle Buckets",
            "info": "This was a tough week for the Buckets as well, who went 0-2 versus White Walkers and Sheep Dogs.  Big man, Raider768083 still leads the league in rebounds with 16.56 rebounds per game.",
            "last": 5
        },
        {
            "team": "Sheep Dogs",
            "info": "It was a big week for Sheep Dogs as they get their first league pro am win versus Seattle Buckets in a dominating 75-54 victory!  JamiahDad32 went off for 36 points on 15/18 FG attempts and motoboto set a new assist record with 18 dimes dropped!  Center, SSGSS Skip snagged 19 boards in the game as well.",
            "last": 6
        },
        {
            "team": "Fiji Kings",
            "info": "Fiji Kings got a forced win this week and a loss versus Snack Time, 66-48. Center, ANTT FS had a nice 14-14 double double in the loss.",
            "last": 7
        }
    ],
    "6": []
}
