{
    "1": [
        {
            "team": "Generation M",
            "info": "Generation of Miracles kicked the season off with a pair of dominating wins vs White Walkers and Sheep Dogs. In team stats, they lead the league in points per game (85), assists (26), and rebound (29). And defensively, it was more domination as they held their opponents to an average of 47 ppg (1st in league).  TTM Dondada holds 2 league records at the moment, averaging a league high 32 points per game and 6 steals per game…A true 2 way threat! Point guard, TTM Trixz averages a league high 14.5 assists per game.",
            "last": 0
        },
        {
            "team": "Purple Haze",
            "info": "Purple Haze holds a 2-0 record in tight battles versus Seattle Buckets and Snack Time. They’re 2nd in both offensive and defensive rankings. They’ve been making it rain from downtown, shooting a league high 60% from three point range on 22 attempts per game! Splash Brothers 2.0, Phat Chub and PurpNowitzki are shooting 90% and 89% respectively from downtown on over 9 attempts per game each. Opponents may want to bring out their rain coats with those numbers.",
            "last": 0
        },
        {
            "team": "Snack Time",
            "info": "After week 1, Snack Time sits at 1-1 and finds themselves 3rd in the power rankings. Game 1 versus Purple Haze was tighter than it looks on the scoreboard, but a shaky 2nd and 4th quarter led to their 68-52 loss. They bounced back versus the Sheep Dogs in a dominating 86-43 victory. Some may say they were out for blood (I wouldn’t, but some might.) PG, Sergio Dipp has been dishing out dimes, averaging 12 a game and now holds a league record high 17 assists vs Sheep Dogs.",
            "last": 0
        },
        {
            "team": "Seattle Buckets",
            "info": "The Buckets start the season off with a 1-1 record. In their first game vs 2nd ranked Purple haze, they led 26-18 in the 1st half. But, they lost their mojo in the 2nd half and ultimately lost the game, 56-47.  They had a nice 56-50 victory in their 2nd game versus the Powered Gaming Dragon however, with ACTBADJR posting 24 points and a 18-18 double-double from center Raider768083. Raider currently leads the league in rebounds with an impressive 19.5 rpg average.",
            "last": 0
        },
        {
            "team": "White Walkers",
            "info": "White Walkers started their season off with an ugly 76-51 loss vs Generation of Miracles.  They were down just 9 points in the 3rd quarter, but once center Memphis Isle lagged out of the game, they fell apart.  They bounced back versus Gaming Dragons with a solid 54-42 victory. PG, TicTacTy3204 had a solid season start averaging 16.5 points, 7.5 assists, and 2.5 steals per game.",
            "last": 0
        },
        {
            "team": "Powered Gaming Dragons",
            "info": "The Dragons didn’t have the start they wanted, going 0-2. But, both games they lost were pretty tight. In fact, in their loss against the Seattle Buckets, they actually won 3/4 quarters. The 2nd quarter was killer as the Buckets out scored them 20-4. Mackie Queso starts the season off strong posting 16.5 ppg, 7 rpg, and shooting 71% from downtown!",
            "last": 0
        },
        {
            "team": "Sheep Dogs",
            "info": "Sheep Dogs begin the season with an 0-2 record. And let’s face it, neither game was pretty. However, they faced 2 very tough opponents in Generation of Miracles and Snack Time. This young team has new faces on it and are figuring out their game, so don’t count them out! They recently signed PG, SnoopDeeDoo who hopes to help bring this organization to the next level. ASaintsChaos posted an impressive 22 points and went 6/10 on 3 point attempts in the 1 game he played.",
            "last": 0
        }
    ]
}
